app/views/placemarks/_story_tree_widget.html.erb

 <ol>
  <% @story.placemarks.each do |placemark| %>
---
SELECT "placemarks".* FROM "placemarks" WHERE "placemarks"."story_id" = $1  [["story_id", 2]]