app/views/stories/show.html.erb

SELECT "placemarks".* FROM "placemarks" WHERE "placemarks"."story_id" = $1  [["story_id", 1]]
---
<%= link_to "Create new placemark", new_story_placemark_path(@story) %>
<% @story.placemarks.each do |placemark| %>