app/controllers/placemarks_controller.rb

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 2]]
---
  def new
    @story = Story.find(params[:story_id])

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "placemarks" ("name", "full_text", "lat", "lon", "image_data", "image_alt", "story_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "sadad"], ["full_text", "asdda"], ["lat", "0.0"], ["lon", "0.0"], ["image_data", "<0 bytes of binary data>"], ["image_alt", ""], ["story_id", 4]]
---
  def create
    @story = Story.find(params[:story_id])
    @placemark = @story.placemarks.new(placemark_params)
    if params[:commit] === "Add Next Placemark"
      puts "\n\n\nadd next\n\n\n"
      if @placemark.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "placemarks".* FROM "placemarks" WHERE "placemarks"."story_id" = $1 AND "placemarks"."id" = $2 LIMIT 1  [["story_id", 2], ["id", 1]]
DELETE FROM "placemarks" WHERE "placemarks"."id" = $1  [["id", 1]]
---
  def destroy
    @story = Story.find(params[:story_id])
    @placemark = @story.placemarks.find(params[:id])
    @placemark.destroy