app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
    @stories = current_or_guest_user.stories.all

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "placemarks".* FROM "placemarks" WHERE "placemarks"."story_id" = $1  [["story_id", 1]]
---
  def show
    @story = current_or_guest_user.stories.find(params[:id])
    @placemarks = @story.placemarks.all

INSERT INTO "stories" ("name") VALUES ($1) RETURNING "id"  [["name", "My Story"]]
---
  def create
    @story = current_or_guest_user.stories.new(story_params)
      if @story.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "stories" WHERE "stories"."id" = $1  [["id", 1]]
---
  def destroy
    @story = current_or_guest_user.stories.find(params[:id])
    @story.destroy